<?php

class Badword  {
	
	private $badword ;

		function __construct()
		{
			$this->badword = [
		    '垃圾', '麻痹', '痴线', '中国', '共产党','法轮功','第一','第1','唯一','唯1','首选','顶级','国家级产品','填补国内空白','顶尖','空前绝后','名牌','巅峰','顶峰','抄底','极端','极品','全网销量第一','王牌','销量冠军','NO1\Top1','极致','永久','领袖品牌','独一无二','绝无仅有','史无前例','万能','绝对','大牌','精确','领导品牌','世界X大 品牌之一','全国X大品牌之一','100%回头客','100%瘦身，国际品质','国家级','世界级','极品','全国首家','世界领先','驰名商标','中国名牌 CCTV ',
		    '央视品牌秒杀全网 ','无同款','淘宝之冠','淘宝之王','前所未有','top品牌','无法超越','独有','国际一流','操','草','麻痹','閪','叼','含卵','吃屎','傻逼'];
		}

		function getBadword($comment)
		{
			$badwords = array_combine($this->badword,array_fill(0,count($this->badword),'*'));
			$str = strtr($comment,$badwords);
			return $str;
		}
	
	
}